/* -----------------------------------------------------------------------------------------
|																						   |
|								    アニメーションのDEFINE宣言							   |
|																						   |
+ --------------------------------------------------------------------------------------- */
// アニメーションイベントのサウンドファイルパスで使用できる最大文字数
#define ANIM_EVENT_SOUNDPATH_MAX_LENGTH			(64)

// アニメーションイベントの最大数
#define ANIM_EVENT_MAX_NUM						(64)

// アニメーションのタイムを整数型に変換する際のスケール
#define ANIM_TIME_INT_SCALE						(10000.0f)

// アニメーションで再生する効果音のファイルが格納されているフォルダ
#define ANIM_SE_FILE_DIRECTORY_PATH				"SE\\"


