/* -----------------------------------------------------------------------------------------
|																						   |
|									ステージのDEFINE宣言								   |
|																						   |
+ --------------------------------------------------------------------------------------- */
// ステージデータファイルの先頭に書き込む文字列
#define STAGEFILE_ID								"MAPD"

// ステージデータに含められる最大キャラ数
#define STAGE_CHARA_MAX_NUM							(256)

// ステージデータに含められる最大オブジェクト数
#define STAGE_OBJECT_MAX_NUM						(512)

// ステージデータに含められる最大オブジェクト用モデル数
#define STAGE_OBJECT_MODEL_MAX_NUM					(256)

// ステージデータに含められる最大イベント数
#define STAGE_EVENT_MAX_NUM							(256)



